import React, { Component } from 'react';

class Content extends Component {
    render() {
        return (
            <div className="content-box">
                <div className="hobby">
                    <p>Хоббі:</p>
                    <ul>
                        <li>Комп'ютерні ігри</li>
                        <li>Фільми</li>
                        <li>Серіали</li>
                        <li>Спорт</li>
                    </ul>
                </div>

                <div className="favorite-movies">
                    <p>Улюблені фільми:</p>
                    <ol>
                        <li>"Евакуація 1 - 2", 2020, 2023</li>
                        <li>"Джентльмени", 2019</li>
                        <li>"Веларіон і місто тисячи планет", 2017</li>
                        <li>"Пробудження", 2016</li>
                    </ol>
                </div>

                <div className="description">
                    <p>Київ — столиця та найбільше місто України, культурний, економічний і політичний центр країни. Розташований на півночі центральної частини України, на обох берегах Дніпра. Місто з багатою історією, Київ відомий своєю архітектурою, парками та культурними пам'ятками.</p>

                    <p>Київ був заснований понад 1,400 років тому і має величезне історичне значення для всієї Східної Європи:</p>
                    <ul>
                    <li>У IX-X століттях був столицею Київської Русі,</li>
                    <li>з 1917-1919 рр. — столицею Української Народної Республіки,</li>
                    <li>з 1934 р. — столицею Української Радянської Соціалістичної Республіки,</li>
                    <li>з 1991 р. — столицею незалежної України.</li>
                    </ul>
                </div>
            </div>
        );
    }
}

export default Content;